#include<stdio.h>
int main()
{
    int num;
    printf("Ramadan Schedule-2020\n");
    printf("Enter the Ramadan No:");
    scanf("%d",&num);
    while(num>30 || num <=0)
    {
        printf("Wrong Ramadan Number.\n\n");
        printf("Enter the no of Ramadan:\n");
        scanf("%d",&num);
    }
    switch(num)
    {
    case 1:
   printf("\n");
        printf("\t*****রমজানের বিবরণ*****\n\n\tরমজান:------------------১ম\n\tতারিখ:-------------------২৫ এপ্রিল\n\tদিন:----------------------শনিবার\n\tসাহরীর সময়:-----------৪:০৫\n\tইফতারের সময়:---------৬:২৮\n");
    break;
    
    case 2:
   printf("\n"); printf("\t*****রমজানের বিবরণ*****\n\n\tরমজান:------------------২য়\n\tতারিখ:-------------------২৬ এপ্রিল\n\tদিন:----------------------রবিবার\n\tসাহরীর সময়:-----------৪:০৪\n\tইফতারের সময়:---------৬:২৯\n");
    break;
    
    case 3:
   printf("\n"); printf("\t*****রমজানের বিবরণ*****\n\n\tরমজান:------------------৩য়\n\tতারিখ:-------------------২৭ এপ্রিল\n\tদিন:----------------------সোমবার\n\tসাহরীর সময়:-----------৪:০৩\n\tইফতারের সময়:---------৬:২৯\n");
    break;
    
    case 4:
   printf("\n"); printf("\t*****রমজানের বিবরণ*****\n\n\tরমজান:------------------৪র্থ\n\tতারিখ:-------------------২৮ এপ্রিল\n\tদিন:----------------------মঙ্গলবার\n\tসাহরীর সময়:-----------৪:০২\n\tইফতারের সময়:---------৬:৩০\n");
    break;
    
    case 5:
   printf("\n"); printf("\t*****রমজানের বিবরণ*****\n\n\tরমজান:------------------৫ম\n\tতারিখ:-------------------২৯ এপ্রিল\n\tদিন:----------------------বুধবার\n\tসাহরীর সময়:-----------৪:০১\n\tইফতারের সময়:---------৬:৩০\n");
    break;
    
    case 6:
   printf("\n");
   printf("\t*****রমজানের বিবরণ*****\n\n\tরমজান:------------------৬ষ্ঠ\n\tতারিখ:-------------------৩০ এপ্রিল\n\tদিন:----------------------বৃহস্পতিবার\n\tসাহরীর সময়:-----------৪:০০\n\tইফতারের সময়:---------৬:৩০\n");
    break;
    
    case 7:
   printf("\n"); printf("\t*****রমজানের বিবরণ*****\n\n\tরমজান:------------------৭ম\n\tতারিখ:-------------------১ মে\n\tদিন:----------------------শুক্রবার\n\tসাহরীর সময়:-----------৩:৫৯\n\tইফতারের সময়:---------৬:৩১\n");
    break;
    
    case 8:
   printf("\n"); printf("\t*****রমজানের বিবরণ*****\n\n\tরমজান:------------------৮ম\n\tতারিখ:-------------------২ মে\n\tদিন:----------------------শনিবার\n\tসাহরীর সময়:-----------৩:৫৮\n\tইফতারের সময়:---------৬:৩২\n");
    break;
    
    case 9:
   printf("\n"); printf("\t*****রমজানের বিবরণ*****\n\n\tরমজান:------------------৯ম\n\tতারিখ:-------------------৩ মে\n\tদিন:----------------------রবিবার\n\tসাহরীর সময়:-----------৩:৫৭\n\tইফতারের সময়:---------৬:৩২\n");
    break;
    
    case 10:
   printf("\n"); printf("\t*****রমজানের বিবরণ*****\n\n\tরমজান:------------------১০ম\n\tতারিখ:-------------------৪ মে\n\tদিন:----------------------সোমবার\n\tসাহরীর সময়:-----------৩:৫৫\n\tইফতারের সময়:---------৬:৩২\n");
    break;
    
    case 11:
   printf("\n"); printf("\t*****রমজানের বিবরণ*****\n\n\tরমজান:------------------১১তম\n\tতারিখ:-------------------৫ মে\n\tদিন:----------------------মঙ্গলবার\n\tসাহরীর সময়:-----------৩:৫৪\n\tইফতারের সময়:---------৬:৩৩\n");
    break;
    
    case 12:
   printf("\n"); printf("\t*****রমজানের বিবরণ*****\n\n\tরমজান:------------------১২তম\n\tতারিখ:-------------------৬ মে\n\tদিন:----------------------বুধবার\n\tসাহরীর সময়:-----------৩:৫৩\n\tইফতারের সময়:---------৬:৩৩\n");
    break;
    
    case 13:
   printf("\n"); printf("\t*****রমজানের বিবরণ*****\n\n\tরমজান:------------------১৩তম\n\tতারিখ:-------------------৭ মে\n\tদিন:----------------------বৃহস্পতিবার\n\tসাহরীর সময়:-----------৩:৫২\n\tইফতারের সময়:---------৬:৩৪\n");
    break;
    
    case 14:
   printf("\n"); printf("\t*****রমজানের বিবরণ*****\n\n\tরমজান:------------------১৪তম\n\tতারিখ:-------------------৮ মে\n\tদিন:----------------------শুক্রবার\n\tসাহরীর সময়:-----------৩:৫১\n\tইফতারের সময়:---------৬:৩৪\n");
    break;
    
     case 15:
   printf("\n"); printf("\t*****রমজানের বিবরণ*****\n\n\tরমজান:------------------১৫তম\n\tতারিখ:-------------------৯ মে\n\tদিন:----------------------শনিবার\n\tসাহরীর সময়:-----------৩:৫০\n\tইফতারের সময়:---------৬:৩৫\n");
    break;
    
    case 16:
   printf("\n"); printf("\t*****রমজানের বিবরণ*****\n\n\tরমজান:------------------১৬তম\n\tতারিখ:-------------------১০ মে\n\tদিন:----------------------রবিবার\n\tসাহরীর সময়:-----------৩:৫০\n\tইফতারের সময়:---------৬:৩৫\n");
    break;
    
    case 17:
   printf("\n"); printf("\t*****রমজানের বিবরণ*****\n\n\tরমজান:------------------১৭তম\n\tতারিখ:-------------------১১ মে\n\tদিন:----------------------সোমবার\n\tসাহরীর সময়:-----------৩:৪৯\n\tইফতারের সময়:---------৬:৩৬\n");
    break;
    
    case 18:
   printf("\n"); printf("\t*****রমজানের বিবরণ*****\n\n\tরমজান:------------------১৮তম\n\tতারিখ:-------------------১২ মে\n\tদিন:----------------------মঙ্গলবার\n\tসাহরীর সময়:-----------৩:৪৯\n\tইফতারের সময়:---------৬:৩৬\n");
    break;
    
    case 19:
   printf("\n"); printf("\t*****রমজানের বিবরণ*****\n\n\tরমজান:------------------১৯তম\n\tতারিখ:-------------------১৩ মে\n\tদিন:----------------------বুধবার\n\tসাহরীর সময়:-----------৩:৪৮\n\tইফতারের সময়:---------৬:৩৬\n");
    break;
    
    case 20:
   printf("\n"); printf("\t*****রমজানের বিবরণ*****\n\n\tরমজান:------------------২০তম\n\tতারিখ:-------------------১৪ মে\n\tদিন:----------------------বৃহস্পতিবার\n\tসাহরীর সময়:-----------৩:৪৮\n\tইফতারের সময়:---------৬:৩৭\n");
    break;
    
    case 21:
   printf("\n"); printf("\t*****রমজানের বিবরণ*****\n\n\tরমজান:------------------২১তম\n\tতারিখ:-------------------১৫ মে\n\tদিন:----------------------শুক্রবার\n\tসাহরীর সময়:-----------৩:৪৭\n\tইফতারের সময়:---------৬:৩৭\n");
    break;
    
     case 22:
   printf("\n"); printf("\t*****রমজানের বিবরণ*****\n\n\tরমজান:------------------২২তম\n\tতারিখ:-------------------১৬ মে\n\tদিন:----------------------শনিবার\n\tসাহরীর সময়:-----------৩:৪৭\n\tইফতারের সময়:---------৬:৩৮\n");
    break;
    
    case 23:
   printf("\n"); printf("\t*****রমজানের বিবরণ*****\n\n\tরমজান:------------------২৩তম\n\tতারিখ:-------------------১৭ মে\n\tদিন:----------------------রবিবার\n\tসাহরীর সময়:-----------৩:৪৬\n\tইফতারের সময়:---------৬:৩৮\n");
    break;
    
    case 24:
   printf("\n"); printf("\t*****রমজানের বিবরণ*****\n\n\tরমজান:------------------২৪তম\n\tতারিখ:-------------------১৮ মে\n\tদিন:----------------------সোমবার\n\tসাহরীর সময়:-----------৩:৪৬\n\tইফতারের সময়:---------৬:৩৯\n");
    break;
    
    case 25:
   printf("\n"); printf("\t*****রমজানের বিবরণ*****\n\n\tরমজান:------------------২৫তম\n\tতারিখ:-------------------১৯ মে\n\tদিন:----------------------মঙ্গলবার\n\tসাহরীর সময়:-----------৩:৪৫\n\tইফতারের সময়:---------৬:৩৯\n");
    break;
    
    case 26:
   printf("\n"); printf("\t*****রমজানের বিবরণ*****\n\n\tরমজান:------------------২৬তম\n\tতারিখ:-------------------২০ মে\n\tদিন:----------------------বুধবার\n\tসাহরীর সময়:-----------৩:৪৪\n\tইফতারের সময়:---------৬:৪০\n");
    break;
    
    case 27:
   printf("\n"); printf("\t*****রমজানের বিবরণ*****\n\n\tরমজান:------------------২৭তম\n\tতারিখ:-------------------২১ মে\n\tদিন:----------------------বৃহস্পতিবার\n\tসাহরীর সময়:-----------৩:৪৪\n\tইফতারের সময়:---------৬:৪০\n");
    break;
    
    case 28:
   printf("\n"); printf("\t*****রমজানের বিবরণ*****\n\n\tরমজান:------------------২৮তম\n\tতারিখ:-------------------২২ মে\n\tদিন:----------------------শুক্রবার\n\tসাহরীর সময়:-----------৩:৪৩\n\tইফতারের সময়:---------৬:৪১\n");
    break;
    
     case 29:
   printf("\n"); printf("\t*****রমজানের বিবরণ*****\n\n\tরমজান:------------------২৯তম\n\tতারিখ:-------------------২৩ মে\n\tদিন:----------------------শনিবার\n\tসাহরীর সময়:-----------৩:৪৩\n\tইফতারের সময়:---------৬:৪২\n");
    break;
    
    case 30:
   printf("\n"); printf("\t*****রমজানের বিবরণ*****\n\n\tরমজান:------------------৩০তম\n\tতারিখ:-------------------২৪ মে\n\tদিন:----------------------রবিবার\n\tসাহরীর সময়:-----------৩:৪২\n\tইফতারের সময়:---------৬:৪২\n");
    break;
        
        
    
    }
    return 0;
}